app/api/login_api.rb

      requires :password, type: String, desc: 'password'
    end
    post do
      user = User.find_by(user_id: params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`user_id` = 'john_doe' LIMIT 1