app/api/users_api.rb

SELECT `users`.* FROM `users` WHERE (`users`.`user_id` = 'john_doe' OR `users`.`nick_name` = 'kalin') ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`user_id`, `password`, `nick_name`, `created_at`, `updated_at`) VALUES ('john_doe', '$2a$12$Pay.ZUi1DRMpgv.ETEErg.kCaazWslNKgKMIjkC234oRAA8zRpfMa', 'kalin', '2023-11-28 13:56:16.884744', '2023-11-28 13:56:16.884744')
---
      requires :password, type: String, desc: '암호'
    end
    post do
      user = User.where(user_id: params[:user_id]).or(User.where(nick_name: params[:nick_name])).first

      return status 409 if user.present?

      if User.create(
        user_id: params[:user_id],
        password: BCrypt::Password.create(params[:password]),
        nick_name: params[:nick_name]
      )